Core/src/DataProcessors/ОобработкаЗагрузкиТабличнойЧастиРегистра/ОобработкаЗагрузкиТабличнойЧастиРегистра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОобработкаЗагрузкиТабличнойЧастиРегистра</name>
</mdclass:DataProcessor>

Core/src/AccumulationRegisters/ВнеоборотныеАктивы/ВнеоборотныеАктивы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВнеоборотныеАктивы</name>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Амортизация</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СодержаниеПроводки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВнеоборотныйАктив</name>
    <type>
      <types>CatalogRef.ВнеоборотныеАктивы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетУчетаРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/DataProcessors/ОобработкаЗагрузкиТабличнойЧастиРегистра/Forms/Форма/Module.bsl
&НаКлиенте
Процедура загрузить(Команда)
	
	
	ЕстьОшибки = ЛОЖЬ;
	загрузитьНаСервере(ЕстьОшибки) ;

	Если ЕстьОшибки Тогда 
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Вопрос(НСтр("ru = 'Продолжить выполнение операции?';"
		+ "ka = 'გაგრძელდეს მონაემების ჩატვირთვა ?'"), Режим, 0);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		Иначе 
			загрузитьНаСервере1();
		КонецЕсли;
		
	Иначе 
		
		загрузитьНаСервере1();
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура загрузитьНаСервере(ЕстьОшибки)
	
	//
	//НаборВнеоборотныеАктивы = РегистрыНакопления.ВнеоборотныеАктивы.СоздатьНаборЗаписей();
	//НаборВнеоборотныеАктивы.Отбор.Регистратор.Установить(Регистратор);
	//НаборВнеоборотныеАктивы.Прочитать();
	//НаборВнеоборотныеАктивы.Загрузить(ТЗ);
	//НаборВнеоборотныеАктивы.ОбменДанными.Загрузка = Истина;
	//НаборВнеоборотныеАктивы.Записать();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВнеоборотныеАктивы.Ссылка,
	|	ВнеоборотныеАктивы.Код,
	|	ВнеоборотныеАктивы.Наименование
	|ИЗ
	|	Справочник.ВнеоборотныеАктивы КАК ВнеоборотныеАктивы";
	
	тзИмущество = Запрос.Выполнить().Выгрузить();
	
	
	
	
	 ///////////////////////
	
	
	
	ТЗ.Очистить();
	КолСтрок = ТабличнийДокумент.ВысотаТаблицы;
	Для Стр = 2 По КолСтрок Цикл
		ИС1 = Формат(Стр, "ЧГ=0");
		ТекстПериод = ТабличнийДокумент.Область("R"+ИС1+"C1").Текст;
		НовСтрока	= ТЗ.Добавить();
		
		Если ЗначениеЗаполнено(Период) тогда
			НовСтрока.Период 		= Период  ;
		Иначе 
			Попытка
				//НовСтрока.Период 		= Дата(Сред(ТекстПериод, 7, 10), Сред(ТекстПериод, 4, 5), Сред(ТекстПериод, 1, 2), Сред(ТекстПериод, 12, 13), Сред(ТекстПериод, 15, 16), Сред(ТекстПериод, 18, 19));//31.03.2013 23:59:59							
				НовСтрока.Период 		= Дата(Сред(ТекстПериод, 7, 10), Сред(ТекстПериод, 4, 5), Сред(ТекстПериод, 1, 2));//30.12.2020		
			Исключение
				Сообщить("თარიღის ველი შესავსებია ან ფორმატი არასწორია.სწორი ფორმატია: 30.12.2020");
			КонецПопытки;
		КонецЕсли;
		
		//Если ЗначениеЗаполнено(ВидДвижения) тогда
		//	НовСтрока.ВидДвижения = ВидДвижения  ;
		//Иначе 
		//	Попытка
		//		
		//		Если ТабличнийДокумент.Область("R"+ИС1+"C2").Текст = "შემოსავალი" Тогда 
		//			НовСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
		//		ИначеЕсли ТабличнийДокумент.Область("R"+ИС1+"C2").Текст = "გასავალი" Тогда
		//			НовСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
		//		КонецЕсли ;
		//	Исключение
		//		Сообщить("ссссс");
		//	КонецПопытки
		//КонецЕсли;
			
			
		ЗначениеКолонки = ПолучитьЗначениеКолонки(тзИмущество, ТабличнийДокумент.Область("R"+Стр+"C7").Текст);   //საინვენტარო ნომერი
		НовСтрока.ВнеоборотныйАктив  = ЗначениеКолонки;
		
		НомерСтр =Стр -1 ;
		//ТабличнийДокумент.Область("R"+ИС1+"C8").Текст = НомерСтр ;
		
		Если не ЗначениеЗаполнено(НовСтрока.ВнеоборотныйАктив)  Тогда 
			Сообщить(  ТабличнийДокумент.Область("R"+ИС1+"C7").Текст +   "- ძ.ს. ამ საინვენტარო ნომერით ვერ მოიძებნა" +"  " "სტრ  " + НомерСтр  ) ;
			ЕстьОшибки = ИСТИНА;				  
		КонецЕсли;
		
		
		Если   Не ЗначениеЗаполнено(НовСтрока.ВнеоборотныйАктив) Тогда 		
			ЗначениеКолонки = ПолучитьЗначениеКолонки1(тзИмущество, ТабличнийДокумент.Область("R"+Стр+"C6").Текст); //ძს
			НовСтрока.ВнеоборотныйАктив  = ЗначениеКолонки;		
		КонецЕсли;
		
		Если не ЗначениеЗаполнено(ВидДвиженияПоУмолчанию) тогда
		НовСтрока.ВидДвижения = ?(ТабличнийДокумент.Область("R"+ИС1+"C4").Текст = "შემოსავალი", ВидДвиженияНакопления.Приход, ВидДвиженияНакопления.Расход);
		Иначе 
		НовСтрока.ВидДвижения =  ВидДвиженияПоУмолчанию ;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Организация) тогда
		НовСтрока.Организация = Организация ;
		Иначе 
		НовСтрока.Организация =  ТабличнийДокумент.Область("R"+ИС1+"C5").Текст ;
		КонецЕсли;
		
		
		//НовСтрока.ВнеоборотныйАктив     = Справочники.ВнеоборотныеАктивы.НайтиПоКоду(ТабличнийДокумент.Область("R"+ИС1+"C3").Текст);
		//Если Не ЗначениеЗаполнено(НовСтрока.ВнеоборотныйАктив) Тогда
		//	НовСтрока.ВнеоборотныйАктив = Справочники.ВнеоборотныеАктивы.НайтиПоНаименованию(ТабличнийДокумент.Область("R"+ИС1+"C4").Текст);
			//Если не ЗначениеЗаполнено(НовСтрока.ВнеоборотныйАктив)  Тогда 
			//	Сообщить(  ТабличнийДокумент.Область("R"+ИС1+"C4").Текст +   "--ნომენკლატურა ვერ მოიძებნა" ) ;
			//	ЕстьОшибки = ИСТИНА;				  
			//КонецЕсли;
		//КонецЕсли;
		
		
		
		
		НовСтрока.Организация 			= Организация;
		НовСтрока.Стоимость 			= ТабличнийДокумент.Область("R"+ИС1+"C8").Текст;
		НовСтрока.Амортизация 			= ТабличнийДокумент.Область("R"+ИС1+"C9").Текст;
		НовСтрока.СодержаниеПроводки 	= ТабличнийДокумент.Область("R"+ИС1+"C10").Текст; 
	КонецЦикла;
	
	
	
	//НаборВнеоборотныеАктивы.ОбменДанными.Загрузка = Истина;
	//НаборВнеоборотныеАктивы.Записать();
	
	
	
	
	
КонецПроцедуры



&НаСервере
Процедура загрузитьНаСервере1()
	
	ТаблицаЗагрузки = ТЗ.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тзЗагрузки.ВидДвижения КАК ВидДвиженияТекст,
		|	тзЗагрузки.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
		|	тзЗагрузки.Стоимость КАК Стоимость,
		|	тзЗагрузки.Амортизация КАК Амортизация,
		|	тзЗагрузки.Период КАК Период,
		|	тзЗагрузки.ВидДвижения КАК ВидДвижения,
		|	тзЗагрузки.ВнеоборотныйАктивКод КАК ВнеоборотныйАктивКод,
		|	тзЗагрузки.СодержаниеПроводки КАК СодержаниеПроводки,
		|	тзЗагрузки.Организация КАК Организация
		|ПОМЕСТИТЬ ВТ_Загрузки
		|ИЗ
		|	&тзЗагрузки КАК тзЗагрузки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ВТ_Загрузки.ВидДвиженияТекст = ""Приход""
		|				ИЛИ ВТ_Загрузки.ВидДвиженияТекст = ""შემოსავალი""
		|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.РАСХОД)
		|	КОНЕЦ КАК ВидДвижения,
		|	ВТ_Загрузки.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
		|	ВТ_Загрузки.Стоимость КАК Стоимость,
		|	ВТ_Загрузки.Амортизация КАК Амортизация,
		|	ВТ_Загрузки.Период КАК Период,
		|	ВТ_Загрузки.ВнеоборотныйАктивКод КАК ВнеоборотныйАктивКод,
		|	ВТ_Загрузки.СодержаниеПроводки КАК СодержаниеПроводки,
		|	ВТ_Загрузки.Организация КАК Организация
		|ИЗ
		|	ВТ_Загрузки КАК ВТ_Загрузки";
	
	Запрос.УстановитьПараметр("тзЗагрузки", ТаблицаЗагрузки);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	
	//Для Каждого Строк из ТаблицаЗагрузки  Цикл 
	//	Если Строк.ВидДвижения = "შემოსავალი" Или Строк.ВидДвижения = "Приход" Тогда 
	//		Строк.ВидДвижения = ВидДвиженияНакопления.Приход;
	//	ИначеЕсли Строк.ВидДвижения = "გასავალი" Или Строк.ВидДвижения = "Расход" Тогда
	//		Строк.ВидДвижения = ВидДвиженияНакопления.Расход;
	//	КонецЕсли;
	//КонецЦикла;
	
	НаборВнеоборотныеАктивы = РегистрыНакопления.ВнеоборотныеАктивы.СоздатьНаборЗаписей();
	НаборВнеоборотныеАктивы.Отбор.Регистратор.Установить(Регистратор);
	НаборВнеоборотныеАктивы.Прочитать();
	НаборВнеоборотныеАктивы.Загрузить(РезультатЗапроса);
	НаборВнеоборотныеАктивы.ОбменДанными.Загрузка = Истина;
	НаборВнеоборотныеАктивы.Записать();

	

КонецПроцедуры // загрузитьНаСервере1()


////сатестоа
&НаСервере
Функция ПолучитьЗначениеКолонки(ТаблицаПоиска, ТекстПоиска)
	
	РезультатПоиска = Неопределено;
	
	ПоискСтрок = ТаблицаПоиска.НайтиСтроки(Новый Структура("Код",ТекстПоиска));
	
	Если ПоискСтрок.Количество() > 0 Тогда 
		РезультатПоиска = ПоискСтрок[0].Ссылка;
	КонецЕсли;
	
	
	Возврат РезультатПоиска;
	
КонецФункции


&НаСервере
Функция ПолучитьЗначениеКолонки1(ТаблицаПоиска, ТекстПоиска)
	
	РезультатПоиска = Неопределено;
	
	ПоискСтрок = ТаблицаПоиска.НайтиСтроки(Новый Структура("Наименование",ТекстПоиска));
	
	Если ПоискСтрок.Количество() > 0 Тогда 
		РезультатПоиска = ПоискСтрок[0].Ссылка;
	КонецЕсли;
	
	
	Возврат РезультатПоиска;
	
КонецФункции
